# Brewfile: Full Install

# TAPS
tap "cirruslabs/cli"
tap "homebrew/bundle"
tap "saulpw/vd"

# BREWS
brew "ansible"
brew "awscli"
brew "bat"
brew "bottom"
brew "btop"
brew "cirruslabs/cli/tart"
brew "dockutil"
brew "doctl"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "glances"
brew "gping"
brew "graphviz"
brew "handbrake"
brew "httpie"
brew "imagemagick"
brew "ipcalc"
brew "iperf"
brew "iperf3"
brew "isort"
brew "jq"
brew "lazygit"
brew "llm"
brew "marked"
brew "mas"
brew "minikube"
brew "mist-cli"
brew "mpv"
brew "mtr"
brew "ncdu"
brew "ngrep"
brew "nmap"
brew "pretter"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "saulpw/vd/visidata"
brew "snowflake"
brew "speedtest-cli"
brew "sqlfluff"
brew "terraform"
brew "terraformer"
brew "tldr"
brew "tmux"
brew "tree"
brew "viddy"
brew "vim"
brew "watch"
brew "wget"
brew "yadm"
brew "yarn"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# CASKS
cask "1password"
cask "1password-cli"
cask "a-better-finder-rename"
cask "alfred"
cask "apparency"
cask "bartender"
cask "bruno"
cask "cleanmymac"
cask "diffusionbee"
cask "discord"
cask "drawio"
cask "dropbox"
cask "firefox"
cask "font-code-new-roman-nerd-font"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-ubuntu-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "handbrake"
cask "iterm2"
cask "mactracker"
cask "microsoft-remote-desktop"
cask "name-mangler"
cask "netspot"
cask "ollama"
cask "qlcolorcode"
cask "raspberry-pi-imager"
cask "screenflow"
cask "setapp"
cask "signal"
cask "slack"
cask "snowflake-snowsql"
cask "soulver"
cask "sublime-text"
cask "suspicious-package"
cask "textexpander"
cask "visual-studio-code"
cask "vlc"
cask "zoom"

# MAS
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "ColorSlurp", id: 1287239339
mas "DaisyDisk", id: 411643860
mas "Discovery", id: 1381004916
mas "Exporter", id: 1099120373
mas "FiveNotes", id: 1231597027
mas "MindNode", id: 1289197285
mas "Moom", id: 419330170
mas "Remote Desktop", id: 409907375
mas "Serial", id: 877615577
mas "Tailscale", id: 1475387142
mas "WiFi Explorer", id: 494803304
mas "WiFi Signal", id: 525912054
