tap "anomalyco/tap", "https://github.com/anomalyco/homebrew-tap.git", trusted: true
tap "cirruslabs/cli", trusted: true
tap "hashicorp/tap", trusted: true
tap "johannesnagl/tap", trusted: true
tap "rhettbull/osxphotos", "https://github.com/RhetTbull/homebrew-osxphotos", trusted: true
tap "visidata/vd", "https://github.com/visidata/homebrew-vd.git", trusted: true
tap "yetidevworks/yscan", trusted: true
# Next-generation aircrack with lots of new features
brew "aircrack-ng"
# General-purpose data compression with high compression ratio
brew "xz"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# ARP scanning and fingerprinting tool
brew "arp-scan"
# Perf monitoring CLI tool for Apple Silicon
brew "asitop"
# Official Amazon AWS command-line interface
brew "awscli"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# Cross-platform make
brew "cmake"
# Reimplementation of ctags(1)
brew "ctags"
# Tool for managing dock items
brew "dockutil"
# Command-line tool for DigitalOcean
brew "doctl"
# Device tree compiler
brew "dtc"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# I/O benchmark and stress test
brew "fio"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# OpenType text shaping engine
brew "harfbuzz"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Alternative to top/htop
brew "glances"
# Ping, but with a graph
brew "gping"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Open-source video transcoder available for Linux, Mac, and Windows
brew "handbrake"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Backup GMail (or other IMAP) accounts to disk
brew "imap-backup"
# Download media from Instagram
brew "instaloader"
# Calculate various network masks, etc. from a given IP address
brew "ipcalc"
# Tool to measure maximum TCP and UDP bandwidth
brew "iperf"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Sort Python imports automatically
brew "isort"
# Command-line pager for JSON data
brew "jless"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Cross-platform software keyboard remapper for Linux, macOS and Windows
brew "kanata"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Access large language models from the command-line
brew "llm"
# Find what models run on your hardware
brew "llmfit"
# MPEG audio decoder
brew "mad"
# Securely transfers data between computers
brew "magic-wormhole"
# Markdown parser and compiler built for speed
brew "marked"
# Mac App Store command-line interface
brew "mas"
# Command-line music player client for mpd
brew "mpc"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Network grep
brew "ngrep"
# Port scanning utility for large networks
brew "nmap"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode"
# AI agent toolkit
brew "pi-coding-agent"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Generic syntax highlighter
brew "pygments"
# Tensors and dynamic neural networks
brew "pytorch"
# Generic machine emulator and virtualizer
brew "qemu"
# Transfer files to and from your computer by scanning a QR code
brew "qrcp"
# File browser
brew "ranger"
# Rsync for cloud storage
brew "rclone"
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Utility that provides fast incremental file transfer
brew "rsync"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Safe, concurrent, practical language
brew "rust"
# Pluggable Transport using WebRTC, inspired by Flashproxy
brew "snowflake"
# SQL linter and auto-formatter for Humans
brew "sqlfluff"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Log file highlighter
brew "tailspin"
# Text interface for Git repositories
brew "tig"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Parser generator tool
brew "tree-sitter-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Terminal spreadsheet multitool for discovering and arranging data
brew "visidata"
# Sends magic packets to wake up network-devices
brew "wakeonlan"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# LAN discovery tool with a modern TUI written in Go
brew "whosthere"
# Why is this running?
brew "witr"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Run macOS and Linux VMs on Apple Hardware
brew "cirruslabs/cli/tart"
# Terraform
brew "hashicorp/tap/terraform"
# Export photos from Apple Photos app and query the Photos database
brew "rhettbull/osxphotos/osxphotos"
# TUI-first network scanner with ARP, mDNS, SSDP, and hostname discovery
brew "yetidevworks/yscan/yscan"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line interface for 1Password
cask "1password-cli"
# Renamer for files, music and photos
cask "a-better-finder-rename"
# Application launcher and productivity software
cask "alfred"
# Agent orchestration platform
cask "antigravity"
# Inspect application bundles
cask "apparency"
# Multi-track audio editor and recorder
cask "audacity"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# 3D model slicing software for 3D printers, maintained by Bambu Lab
cask "bambu-studio"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Open source IDE for exploring and testing APIs
cask "bruno"
# Terminal-based AI coding assistant
cask "claude-code"
# Tool to remove unnecessary files and folders from disk
cask "cleanmymac"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Disk space visualiser
cask "daisydisk"
# Run Stable Diffusion locally
cask "diffusionbee"
# Voice and text chat software
cask "discord"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Matrix collaboration client
cask "element"
# Web browser
cask "firefox"
cask "font-code-new-roman-nerd-font"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-ubuntu-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Disk space cleaner that finds and deletes duplicated and similar files
cask "gemini"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Open-source video transcoder
cask "handbrake-app"
# Automated organisation
cask "hazel"
# iPhone management application
cask "imazing"
# Apple Device Configuration Profile Editor
cask "imazing-profile-editor"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# App to manage software development and track bugs
cask "linear"
# Detailed information on every Apple product ever made
cask "mactracker"
# Text editor
cask "macvim-app"
# Mouse control with the keyboard
cask "mouseless@preview"
# Multi-file renaming tool
cask "name-mangler"
# WiFi site survey software and WiFi scanner
cask "netspot"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Thumbnails, static previews, cover art and metadata for video files
cask "quicklook-video"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Screen recording and video editing software
cask "screenflow"
# Collection of apps available by subscription
cask "setapp"
# 3D CAD software
cask "shapr3d"
# App that enables mouse-free UI interaction
cask "shortcat"
# Quick Look extension that renders Markdown beautifully on macOS
cask "johannesnagl/tap/showmd"
# Instant messaging application focusing on security
cask "signal"
# Team communication and collaboration software
cask "slack"
# CSV editor
cask "smoothcsv"
# Command-line client for connecting to Snowflake
cask "snowflake-snowsql"
# Notepad with a built-in calculator
cask "soulver"
# Text editor for code, markup and prose
cask "sublime-text"
# Application for inspecting installer packages
cask "suspicious-package"
# Mesh VPN based on WireGuard
cask "tailscale-app"
# Messaging app with a focus on speed and security
cask "telegram"
# Menu bar manager
cask "thaw"
# Unpacks archive files
cask "the-unarchiver"
# Email client
cask "tuta-mail"
# AI image upscaler
cask "upscayl"
# Multimedia player
cask "vlc"
# Network monitoring and troubleshooting tool
cask "wifiman"
# Connect to Windows
cask "windows-app"
# Photo viewer, image manager, image resiser and more
cask "xnviewmp"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Actions For Obsidian", id: 1659667937
mas "AmorphousDiskMark", id: 1168254295
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Blackmagic Disk Speed Test", id: 425264550
mas "ColorSlurp", id: 1287239339
mas "Discovery", id: 1381004916
mas "Exporter", id: 1099120373
mas "Fantastical", id: 975937182
mas "GarageBand", id: 682658836
mas "Gemini", id: 463541543
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MindNode Classic", id: 1289197285
mas "Moom Classic", id: 419330170
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "Obsidian Web Clipper", id: 6720708363
mas "Okta Verify", id: 490179405
mas "Pages", id: 361309726
mas "Pages", id: 409201541
mas "Remote Desktop", id: 409907375
mas "Serial", id: 877615577
mas "Soulver 3", id: 1508732804
mas "Table Tool", id: 1122008420
mas "WiFi Explorer", id: 494803304
mas "WiFi Signal", id: 525912054
mas "WireGuard", id: 1451685025
uv "sqlit-tui"
npm "@mermaid-js/mermaid-cli"
npm "csvtojson"
