tap "cirruslabs/cli"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "kismetwireless/kismet"
tap "saulpw/vd"
brew "aircrack-ng"
brew "xz"
brew "ansible"
brew "awscli"
brew "bat"
brew "bottom"
brew "btop"
brew "gnutls"
brew "cask"
brew "cheat"
brew "cmake"
brew "cmatrix"
brew "ctags"
brew "d2"
brew "docker"
brew "dockutil"
brew "doctl"
brew "fd"
brew "harfbuzz"
brew "fzf"
brew "gh"
brew "git"
brew "glances"
brew "gping"
brew "graphviz"
brew "handbrake"
brew "howdoi"
brew "httpie"
brew "imagemagick"
brew "ipcalc"
brew "iperf"
brew "iperf3"
brew "isort"
brew "jq"
brew "lazygit"
brew "llm"
brew "macvim"
brew "mad"
brew "node"
brew "marked"
brew "mas"
brew "mpc"
brew "yt-dlp"
brew "mpv"
brew "mtr"
brew "ncdu"
brew "ngrep"
brew "nmap"
brew "pkgconf"
brew "prettier"
brew "protobuf"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "pytorch"
brew "rclone"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "rust"
brew "snowflake"
brew "speedtest-cli"
brew "sqlfluff"
brew "subversion"
brew "tailscale"
brew "tailspin"
brew "terraformer"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "trippy"
brew "viddy"
brew "watch"
brew "wget"
brew "yadm"
brew "yarn"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "cirruslabs/cli/tart"
brew "hashicorp/tap/terraform"
brew "saulpw/vd/visidata"
cask "1password"
cask "1password-cli"
cask "a-better-finder-rename"
cask "alfred"
cask "apparency"
cask "audacity"
cask "bartender"
cask "bruno"
cask "cleanmymac"
cask "diffusionbee"
cask "discord"
cask "drawio"
cask "dropbox"
cask "dropbox-capture"
cask "firefox"
cask "font-code-new-roman-nerd-font"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-ubuntu-nerd-font"
cask "gemini"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "handbrake"
cask "iterm2"
cask "mactracker"
cask "name-mangler"
cask "netspot"
cask "ollama"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "rar"
cask "raspberry-pi-imager"
cask "screenflow"
cask "setapp"
cask "signal"
cask "slack"
cask "snowflake-snowsql"
cask "soulver"
cask "sublime-text"
cask "suspicious-package"
cask "textexpander"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "vmware-fusion"
cask "webpquicklook"
cask "wifiman"
cask "windows-app"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Agenda", id: 1287445660
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "ColorSlurp", id: 1287239339
mas "Comic Life", id: 688953417
mas "DaisyDisk", id: 411643860
mas "Discovery", id: 1381004916
mas "Disk Speed Test", id: 425264550
mas "Exporter", id: 1099120373
mas "Fantastical", id: 975937182
mas "FiveNotes", id: 1231597027
mas "GarageBand", id: 682658836
mas "Gemini", id: 463541543
mas "Goodnotes", id: 1444383602
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "MindNode", id: 1289197285
mas "Moom Classic", id: 419330170
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Remote Desktop", id: 409907375
mas "Serial", id: 877615577
mas "Soulver 3", id: 1508732804
mas "Strip Design", id: 314780738
mas "Tailscale", id: 1475387142
mas "WiFi Explorer", id: 494803304
mas "WiFi Signal", id: 525912054
mas "WireGuard", id: 1451685025
vscode "continue.continue"
vscode "davidanson.vscode-markdownlint"
vscode "dnicolson.binary-plist"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "googlecloudtools.cloudcode"
vscode "hashicorp.terraform"
vscode "hediet.vscode-drawio"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "janisdd.vscode-edit-csv"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "parallelsdesktop.parallels-desktop"
vscode "rvest.vs-code-prettier-eslint"
vscode "terrastruct.d2"
vscode "tomoyukim.vscode-mermaid-editor"
vscode "vscodevim.vim"
vscode "yzhang.markdown-all-in-one"
