# Brewfile: Developer Install

# TAPS
tap "cirruslabs/cli"
tap "homebrew/bundle"
tap "saulpw/vd"

# BREWS
brew "ansible"
brew "awscli"
brew "bat"
brew "cirruslabs/cli/tart"
brew "doctl"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "httpie"
brew "imagemagick"
brew "isort"
brew "jq"
brew "lazygit"
brew "llm"
brew "mas"
brew "minikube"
brew "ncdu"
brew "prettier"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "saulpw/vd/visidata"
brew "snowflake"
brew "sqlfluff"
brew "terraform"
brew "terraformer"
brew "tldr"
brew "tmux"
brew "tree"
brew "viddy"
brew "vim"
brew "watch"
brew "yadm"
brew "yarn"
brew "yq"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# CASKS
cask "1password"
cask "1password-cli"
cask "alfred"
cask "apparency"
cask "bruno"
cask "drawio"
cask "font-code-new-roman-nerd-font"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-ubuntu-nerd-font"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "ollama"
cask "slack"
cask "snowflake-snowsql"
cask "suspicious-package"
cask "visual-studio-code"

# MAS
mas "ColorSlurp", id: 1287239339

