# Brewfile: Minimal Install

tap "cirruslabs/cli"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "saulpw/vd"
brew "xz"
brew "ansible"
brew "protobuf"
brew "awscli"
brew "bat"
brew "bottom"
brew "btop"
brew "gnutls"
brew "cask"
brew "cmake"
brew "ctags"
brew "dockutil"
brew "doctl"
brew "duf"
brew "fd"
brew "harfbuzz"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "glances"
brew "gping"
brew "httpie"
brew "imagemagick"
brew "ipcalc"
brew "iperf"
brew "iperf3"
brew "isort"
brew "jq"
brew "llm"
brew "magic-wormhole"
brew "node"
brew "marked"
brew "mas"
brew "mtr"
brew "ncdu"
brew "ngrep"
brew "nmap"
brew "pkgconf"
brew "prettier"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pygments"
brew "pytorch"
brew "qrcp"
brew "rename"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "rust"
brew "snowflake"
brew "speedtest-cli"
brew "sqlfluff"
brew "tailscale"
brew "tailspin"
brew "terraformer"
brew "tig"
brew "tldr"
brew "tmux"
brew "tree"
brew "uv"
brew "visidata"
brew "watch"
brew "wget"
brew "yadm"
brew "yarn"
brew "yq"
brew "yt-dlp"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "cirruslabs/cli/tart"
brew "hashicorp/tap/terraform"
cask "1password"
cask "1password-cli"
cask "a-better-finder-rename"
cask "alfred"
cask "apparency"
cask "bruno"
cask "cleanmymac"
cask "discord"
cask "drawio"
cask "dropbox"
cask "firefox"
cask "font-code-new-roman-nerd-font"
cask "font-hack-nerd-font"
cask "font-sauce-code-pro-nerd-font"
cask "font-ubuntu-nerd-font"
cask "gcloud-cli"
cask "google-chrome"
cask "google-drive"
cask "iterm2"
cask "linear-linear"
cask "macvim-app"
cask "msty"
cask "name-mangler"
cask "obsidian"
cask "ollama-app"
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "rar"
cask "setapp"
cask "shortcat"
cask "signal"
cask "slack"
cask "snowflake-snowsql"
cask "soulver"
cask "sublime-text"
cask "suspicious-package"
cask "the-unarchiver"
cask "vlc"
cask "void"
cask "webpquicklook"
cask "windows-app"
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "ColorSlurp", id: 1287239339
mas "DaisyDisk", id: 411643860
mas "Discovery", id: 1381004916
mas "Gemini", id: 463541543
mas "MindNode", id: 1289197285
mas "Moom Classic", id: 419330170
mas "Okta Verify", id: 490179405
mas "openterface", id: 6478481082
mas "Remote Desktop", id: 409907375
mas "Serial", id: 877615577
mas "Soulver 3", id: 1508732804
mas "Tailscale", id: 1475387142
mas "WiFi Explorer", id: 494803304
mas "WiFi Signal", id: 525912054
mas "WireGuard", id: 1451685025
